Autodesk.Revit.DB.TilePatterns.GetTilePattern(Autodesk.Revit.DB.TilePatternsBuiltIn)
Retrieve a TilePattern object from a built-in type.
Returns: A TilePattern object, or null if the document is not a
Massing Family.

Autodesk.Revit.DB.TilePatterns
The TilePatterns object is an interface for retrieving the TilePattern objects
within the Document.